package com.hb.client;

import java.util.ArrayList;

import com.hb.model.MediaModel;

public class TestMedia {

	public static ArrayList<MediaModel> getList() {
		ArrayList<MediaModel> list = new ArrayList<MediaModel>();

		MediaModel model1 = new MediaModel();
		model1.setType(1);
		model1.setTitle("罗马尼亚基督教大学代表团来我校访问");
		model1.setContent("    10月9日，罗马尼亚基督教大学校长、副校长一行4人来我校正式访问，这是我校第一次接待来自罗马尼亚的代表团。我校党委书记张雪、外国语学院院长封一函、教育学院党委书记方平、国际文化学院党总支书记兼副院长韩梅、国际文化学院副院长张静、政法学院副院长吴高臣、管理学院蒋景媛会见了来访客人。" + "\n\n    张雪书记和罗马尼亚基督教大学校长介绍了各自学校的概况，并畅谈了促进两校国际化发展的良好期望。中外双方院系负责人分别介绍了各自院系及专业情况。张雪书记指出，两校可以多种方式进行合作，如3+1、2+2、学生交换、对外汉语专业学生实习、教师交换、合作研究等等。罗马尼亚基督教大学3年前开设了中文专业，中文师资奇缺，希望我校每年能派中文教师及对外汉语教学实习生教授中文课程，并帮助其培养本校师资。" + "\n\n    这次访问为两校进一步合作与交流奠定了良好的基础，两校将尽快签署合作协议，启动合作项目。");
		model1.setTime("2013-11-12 10:30");
		model1.setPics(new String[] { "http://www.cnu.edu.cn/download.jsp?attachSeq=15161&filename=20131011171639480.jpg", "http://www.cnu.edu.cn/download.jsp?attachSeq=15157&filename=20131011170853141.jpg" });
		list.add(model1);

		MediaModel model2 = new MediaModel();
		model2.setType(1);
		model2.setTitle("我校成立不来梅孔子学院");
		model2.setContent("    10月23日，我校第6所孔子学院——德国不来梅孔子学院揭牌成立。常务副校长宫辉力，国际文化学院院长刘晓天，研究生院院长、数学科学学院院长李庆忠和孔子学院管理办公室主任韩梅参加了揭牌系列活动。" + "\n\n    揭牌仪式在不来梅市政厅举行，该市政厅有600多年历史，2004年被列入联合国教科文组织世界文化遗产名录，是德国唯一一个未遭二战毁坏的市政厅，也是不来梅地区最高规格的场所。 " + "\n\n    出席揭牌仪式并讲话的嘉宾有中国驻汉堡领事馆杨惠群总领事和德方负责经济事务的国务委员Heseler博士。不来梅电台资深主持人Schlüte先生主持仪式。当地商贸、企业、文化、教育各界代表以及德国其他孔院院长等240余人参加了仪式。 " + "\n\n    常务副校长宫辉力代表孔院中方合作学校致辞，他指出：“文化的交流能够产生推动文化前进的动力，相信不来梅孔子学院正是这样一个平台，能够为中德文化交流贡献自己的力量，让更多的德国朋友了解汉语，了解中国。”常务副校长宫辉力向孔院赠送了欧阳中石先生的墨宝“不来梅孔子学院”。 " + "\n\n    在现场访谈环节，参会的中、德嘉宾现身说法，就不来梅州建立孔子学院的意义发表感想，积极肯定了孔子学院传播文化和促进两国经贸发展的重要性，有效转变了他人对孔子学院的疑虑。" + "\n\n    不来梅孔子学院以不来梅科技大学为主与我校合作建立，同时联合不来梅大学、雅各布大学和不来梅州经济部共同开展活动。其中不来梅大学是德国精英大学，雅各布大学是德国第一所私立大学，全英文授课。不来梅孔子学院的建立为我校搭建了更高的合作平台。");
		model2.setTime("2013-10-31 10:10");
		model2.setPics(new String[] { "http://www.cnu.edu.cn/download.jsp?attachSeq=15362&filename=20131031155715804.jpg", "http://www.cnu.edu.cn/download.jsp?attachSeq=15368&filename=20131101090654481.jpg" });
		list.add(model2);

		MediaModel model3 = new MediaModel();
		model3.setType(1);
		model3.setTitle("我校举行60周年校庆倒计时一周年启动仪式");
		model2.setContent("    金秋送爽，丹桂飘香。10月9日上午，在充满着收获的金秋时节，在即将迎来建校60周年的喜庆日子里，我校在北一区国际文化大厦二层报告厅举行60周年校庆倒计时一周年启动仪式。我校党委书记张雪、党委副书记林蓉蓉、纪委书记潘亮、副校长马常、沈千帆，各院（系）、单位中层正职、院（系）副书记、校友代表、师生代表300余人出席了倒计时启动仪式。启动仪式由纪委书记潘亮主持。" + "\n\n    潘亮书记指出，从今天的启动仪式开始，学校今后将按照“节俭、务实、隆重、热烈”的原则，开始一系列60周年校庆筹备工作。通过举办60周年校庆，回顾历史、总结经验、展示成就，进一步凝聚人心，汇聚力量，继往开来，努力把首都师范大学建成有特色、高水平的师范大学。 " + "\n\n    副校长马常发布了关于征集首都师范大学校标及校庆60周年活动标识的启事。学校决定对校标进行重新设计。面向全校师生员工、广大校友和关心支持学校发展的社会各界人士公开征集60周年校庆标识。校标征集、校庆标识设计要求、征集时间和作品投递、评奖及相关说明见校园网主页。" + "\n\n    沈千帆副校长宣读了首都师范大学教育基金会鸣谢办法。为进一步扩大教育基金会的影响力，更好开展筹资工作，推动学校和教育事业更好发展，特制订捐赠鸣谢办法，本办法具体细则可在学校教育基金会网站上查询。" + "\n\n    历史学院教授、博士生导师齐世荣先生应邀出席仪式并讲话，他作为学校发展的参与者、见证者，深情回顾了在一代代有理想、有志气、有信念的首都师大人带领下学校由小到大、由弱到强的艰辛历程，特别指出经过多年的发展，师资队伍、学科建设、学生数量以及学校的影响力都发生显著变化，他坚信，经过一代代首都师大人不断努力，学校一定能成为一所国内一流、国际知名大学。 "
				+ "\n\n    校友代表，我校生命科学学院88级毕业生东城区副区长朴学东应邀出席仪式并讲话，他代表广大海内外校友真情感谢母校的教育和培养，与师生分享了作为首都师大人的自豪感和荣誉感，并以多年来我校学位点建设、实验室创建、研究基地建设、图书馆藏书量等学校发展指标体系的变化为例，通过翔实数据对比，诠释学校发展脉络，充分肯定了近60年来学校发展取得的辉煌成就。朴学东校友表示，今后愿与其他校友一道为学校的发展建设贡献智慧和力量。");
		model2.setTime("2013-09-31 13:10");
		model3.setPics(new String[] { "http://www.cnu.edu.cn/download.jsp?attachSeq=15145&filename=20131010090642491.jpg" });

		MediaModel model4 = new MediaModel();
		model4.setType(1);
		model4.setTitle("张雪书记讲党的群众路线教育实践活动专题党课");
		model2.setContent("    9月23日下午，党委书记张雪在国际文化大厦二层报告厅为全校中层以上领导干部讲了一堂思想深刻、内容丰富的党的群众路线教育实践活动专题党课。这次党课既是市委要求的一项规定动作，也是我校群众路线教育实践活动学习教育的一个关键环节。"
				+ "\n\n    张雪书记的党课既有对党的群众路线形成、发展的历史总结，又有对群众路线教育实践活动主题的理论阐释；既有对学校“四风”问题的深刻反思，又有对加强作风建设、做好新形势下群众工作的具体要求。党课主要有三个方面的内容：一是要全面把握党的群众路线的丰富内涵和历史作用，要从党章的发展中深刻把握党的群众路线的基本观点，要从历史的比较中深刻认识党的群众路线的生命线作用，要从现实的反思中深刻领会党的群众路线的时代要求，从而不断提高对深入开展党的群众路线教育实践活动的重大意义和现实紧迫性的认识。二是要正确认识为民务实清廉的辩证关系和基本要求。张雪书记强调指出，为民、务实、清廉既是群众路线的内涵，又深刻体现了党的价值追求，是时代和实践、党心和民心对党的群众路线优良传统提出的新的更高的要求。没有为民的目的和情怀，没有务实的精神和作风，没有清廉的品质和形象，坚持群众路线就失去了依据和方向。为民就必须强化宗旨意识，站稳群众立场，坚持反对官僚主义。务实就必须坚持实事求是，践行思想路线，坚决反对形式主义。清廉就必须永葆政治本色，树立良好形象，坚决反对享乐主义和奢靡之风。三是要努力提高做好新形势下群众工作的能力和水平。张雪书记在党课中聚焦“四风”问题，认真梳理了近一段时间通过“面对面”“背对背”形式征求广大师生员工的意见和建议，强调在今后的工作中，要把立行立改、边查边改贯穿教育实践活动始终，要着眼长效机制建设，加强顶层设计，狠抓整改落实，确保取得实效，努力把教育实践活动办成一项师生满意工程。为此，她对全校领导干部提出四点要求：要坚定理想信念，深化理论武装，打牢做好群众工作的政治思想基础。要树立群众观点，强化宗旨意识，怀着对群众的深厚感情做好群众工作。要立足岗位实践，增强工作本领，提高做好群众工作的针对性实效性。要加强自身修养，提升道德境界，以良好的人格魅力赢得师生员工信任。"
				+ "");
		model2.setTime("2013-09-13 09:40");
		model4.setPics(new String[] { "http://www.cnu.edu.cn/download.jsp?attachSeq=15051&filename=20130924144603316.jpg" });
		
		list.add(model1);
		list.add(model2);
		list.add(model1);
		list.add(model2);
		list.add(model1);
		list.add(model2);
		list.add(model1);
		list.add(model2);
		list.add(model1);
		list.add(model2);

		return list;

	}
}
